<a href="https://colab.research.google.com/github/eswarpoluri/ML-DL-Practice-Assignments/blob/master/ML/Pandas/2.%20DataFrames/Pandas_Dataframe_Answers.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Pandas DataFrame

In [ ]:
import pandas as pd
import numpy as np

    Q1. Write a Pandas program to convert the given array's into dataframe
    Sample data: {'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}
    Expected Output:
      X  Y  Z
    0 78 84 86
    1 85 94 97
    2 96 89 96
    3 80 83 72
    4 86 86 83

In [ ]:
d={'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}

In [ ]:
pd.DataFrame(d)

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

Q2. Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.

In [ ]:
# Sample DataFrame:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [ ]:
df=pd.DataFrame(exam_data,index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

Q3. Write a Pandas program to display a summary of the basic "information" about the above DataFrame and its data.

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

Q4. Write a Pandas program to get the first 3 rows of above DataFrame.

In [ ]:
# Sol-1
df.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [ ]:
# Sol-2
df.iloc[:3]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

Q5. Write a Pandas program to select the 'name' and 'score' columns from the above DataFrame.

In [ ]:
df.loc[:,['name','score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

Q6. Write a Pandas program to select the specified columns and rows from the above DataFrame.
Select 'name' and 'score' columns in rows 1, 3, 5, 6 from the following data frame.

In [ ]:
# Sol - 1
df.loc[["b","d","f","g"],['name','score']]

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

In [ ]:
# Sol - 2 
df.iloc[[1, 3, 5, 6], [1, 3]]

   score qualify
b    9.0      no
d    NaN      no
f   20.0     yes
g   14.5     yes

Q7. Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2.

In [ ]:
df.loc[df['attempts']>2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

Q8. Write a Pandas program to count the number of rows and columns of a DataFrame.

In [ ]:
# No of rows
# Sol-1
df.name.count()

10

In [ ]:
# Sol-2
len(df.axes[0])

10

In [ ]:
# No of columns
# Sol-1
len(df.columns)

4

In [ ]:
# Sol-2
len(df.axes[1])

4

Q9. Write a Pandas program to select the rows where the score is missing, i.e. is NaN.

In [ ]:
#Sol-1
df[df.score.isna()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [ ]:
# Sol-2
df[df['score'].isnull()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

Q10. Write a Pandas program to select the rows the score is between 15 and 20 (inclusive).

In [ ]:
# Sol-1
df[(df['score']>15) & (df['score']<=20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [ ]:
# Sol-2
df[df['score'].between(15, 20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

Q11. Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15.

In [ ]:
df[(df['attempts']<2) & (df['score']>15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

Q12. Write a Pandas program to change the score in row 'd' to 11.5.

In [ ]:
df.loc['d',['score']]=11.5
df.loc[['c','d'],:]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
d      James   11.5         3      no

Q13. Write a Pandas program to calculate the sum of the examination attempts by all the students.

In [ ]:
df.attempts.sum()

19

Q14. Write a Pandas program to calculate the mean score for each different student in data frame.

In [ ]:
df.score.mean()

13.333333333333334

Q15. Write a Pandas program to append a new row 'k' to DataFrame with given values for each column. Now delete the new row and return the original data frame.

In [ ]:
# Sol-1 
# ** DF.append will append the data frame, but it will not keep it in place, so we have to reassign the appended data frame to the same DF. 
# inplace = True option is not there in DF.append. In lists we can append without reassign. Same the case with DF.merge.

df2=pd.DataFrame([['Tom',10.0,1,'Yes']], index=['k'],columns=['name', 'score', 'attempts', 'qualify'])
df.append(df2)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k        Tom   10.0         1     Yes

In [ ]:
df.loc['k']=['Tom',10,1,'Yes']
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k        Tom   10.0         1     Yes

In [ ]:
df.drop('k', inplace=True)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

Q16. Write a Pandas program to sort the data frame first by 'name' in descending order, then by 'score' in ascending order.

In [ ]:
# ** 5.	Shorting with multi columns is possible. 
df.sort_values(by=['name', 'score'], ascending=[False, True])

        name  score  attempts qualify
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

Q17. Write a Pandas program to replace the ‘qualify' column contains the values 'yes' and 'no' with True and False.

In [ ]:
# Sol-1
df.loc[df['qualify']=='yes',['qualify']]=True
df.loc[df['qualify']=='no',['qualify']]=False
df

        name  score  attempts qualify
a  Anastasia   12.5         1    True
b       Dima    9.0         3   False
c  Katherine   16.5         2    True
d      James   11.5         3   False
e      Emily    9.0         2   False
f    Michael   20.0         3    True
g    Matthew   14.5         1    True
h      Laura    NaN         1   False
i      Kevin    8.0         2   False
j      Jonas   19.0         1    True

In [ ]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data , index=labels)

# Sol-2 ** Use df.column.map(dict()) to replace all value in that column with another or same value. 
# ** For replacing multiple values to one unique value use df column.replace('yes', 'True')
df['qualify'] = df['qualify'].map({'yes': True, 'no': False})
df

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James    NaN         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

Q18. Write a Pandas program to change the name 'James' to 'Suresh' in name column of the data frame.

In [ ]:
df.loc[df['name']=='James',['name']]='Suresh'
df

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d     Suresh    NaN         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

In [ ]:
df['name'].replace('James', 'Suresh')
df

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d     Suresh    NaN         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

Q19. Write a Pandas program to delete the 'attempts' column from the DataFrame.

In [ ]:
# Sol-1
df.drop(columns=['attempts'])

        name  score  qualify
a  Anastasia   12.5     True
b       Dima    9.0    False
c  Katherine   16.5     True
d     Suresh    NaN    False
e      Emily    9.0    False
f    Michael   20.0     True
g    Matthew   14.5     True
h      Laura    NaN    False
i      Kevin    8.0    False
j      Jonas   19.0     True

In [ ]:
# Sol-2
df.pop('attempts')
df

        name  score  qualify
a  Anastasia   12.5     True
b       Dima    9.0    False
c  Katherine   16.5     True
d     Suresh    NaN    False
e      Emily    9.0    False
f    Michael   20.0     True
g    Matthew   14.5     True
h      Laura    NaN    False
i      Kevin    8.0    False
j      Jonas   19.0     True

Q20. Write a Pandas program to insert a new column color in existing DataFrame.

In [ ]:
color = ['Red','Blue','Orange','Red','White','White','Blue','Green','Green','Red']
df['color']=color
df

        name  score  qualify   color
a  Anastasia   12.5     True     Red
b       Dima    9.0    False    Blue
c  Katherine   16.5     True  Orange
d     Suresh    NaN    False     Red
e      Emily    9.0    False   White
f    Michael   20.0     True   White
g    Matthew   14.5     True    Blue
h      Laura    NaN    False   Green
i      Kevin    8.0    False   Green
j      Jonas   19.0     True     Red

    Q21. Write a Pandas program to iterate over rows in a DataFrame and print row name and row score
    sample output:
    Anastasia 12.5                                                         
    Dima 9.0                                                               
    Katherine 16.5

In [ ]:
# Sample Python dictionary data and list labels:
exam_data = [{'name':'Anastasia', 'score':12.5}, {'name':'Dima','score':9}, {'name':'Katherine','score':16.5}] 
df1=pd.DataFrame(exam_data)
for index, i in df.iterrows():  # ** DF can be itterable using df.iterrows()
  print(i['name'], i['score'])

Anastasia 12.5
Dima 9.0
Katherine 16.5
Suresh nan
Emily 9.0
Michael 20.0
Matthew 14.5
Laura nan
Kevin 8.0
Jonas 19.0

Q22. Write a Pandas program to get list from DataFrame column headers.

In [ ]:
list(df.columns.values)

['name', 'score', 'qualify', 'color']

Q23. Write a Pandas program to rename columns of a given DataFrame.

In [ ]:
d = {'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]}
new_names=['Column1', 'Column2', 'Column3']
df5=pd.DataFrame(d)
df5

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

In [ ]:
df5=df5.rename(columns={'col1':'Column1','col2':'Column2','col3':'Column3'}) 
# ** inplace option not avilable. so self assign the data afterrename  
df5

   Column1  Column2  Column3
0        1        4        7
1        2        5        8
2        3        6        9

Q24. Write a Pandas program to select rows from a given DataFrame based on values in some columns.
filter the rows of colum1 value == 4

In [ ]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df6 = pd.DataFrame(data=d)
df6

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [ ]:
df6[df6['col1']==4]

   col1  col2  col3
1     4     5     8
3     4     7     0

Q25. Write a Pandas program to change the order of a above DataFrame columns to 'col3', 'col2', 'col1'

In [ ]:
# Sol-1
df6.reindex(columns=['col3', 'col2', 'col1'])

   col3  col2  col1
0     7     4     1
1     8     5     4
2     9     6     3
3     0     7     4
4     1     8     5

In [ ]:
# Sol-2
df6[['col3', 'col2', 'col1']]

   col3  col2  col1
0     7     4     1
1     8     5     4
2     9     6     3
3     0     7     4
4     1     8     5

Q26. Write a Pandas program to add one row with values 10, 11, 12 in an above DataFrame.

In [ ]:
#df6.iloc
df6.loc[5]=[10,11,12]
df6

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
5    10    11    12

Q27. Write a Pandas program to write above DataFrame to CSV file using tab separator.

In [ ]:
df6.to_csv('op.csv',sep='\t', index=False) 
#** keep index = False as best practice, we will get index as a new column else while reading it back

In [ ]:
pd.read_csv('/content/op.csv',sep='\t')

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
5    10    11    12

    Q28. Write a Pandas program to count city wise number of people from a given of data set (city, name of the person).
              city  Number of people
    0   California                 4
    1      Georgia                 2
    2  Los Angeles                 4

In [ ]:
df7 = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'city': ['California', 'Los Angeles', 'California', 'California', 'California', 'Los Angeles', 'Los Angeles', 'Georgia', 'Georgia', 'Los Angeles']})
df7

        name         city
0  Anastasia   California
1       Dima  Los Angeles
2  Katherine   California
3      James   California
4      Emily   California
5    Michael  Los Angeles
6    Matthew  Los Angeles
7      Laura      Georgia
8      Kevin      Georgia
9      Jonas  Los Angeles

In [ ]:
df7.groupby('city').size().reset_index(name='Number of people')
# ** count will give only if values are present in rows.
# ** size will give even if some rows are nan

          city  Number of people
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

Q29. Write a Pandas program to delete DataFrame row(s) where value of co12 is not equal to 5

In [ ]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df6 = pd.DataFrame(data=d)
df6

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [ ]:
# Sol 1
df6[~df6.col2.isin([5])]

   col1  col2  col3
0     1     4     7
2     3     6     9
3     4     7     0
4     5     8     1

In [ ]:
# Sol 2
df6[df6.col2 != 5]

   col1  col2  col3
0     1     4     7
2     3     6     9
3     4     7     0
4     5     8     1

Q30. Write a Pandas program to widen output display to see more columns.

In [ ]:
import pandas as pd
import numpy as np
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df6 = pd.DataFrame(data=d)
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)  # ** This option is used if we have more columns
pd.set_option('display.width', 1000)
print("Original DataFrame")
df6

Original DataFrame

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

Q31. Write a Pandas program to select a row of dataframe by given integer index.
select and display the row with Index=2 of the above DF

In [ ]:
df6.iloc[2,:]

col1    3
col2    6
col3    9
Name: 2, dtype: int64

Q32. Write a Pandas program to replace all the NaN values with Zero's in a column of a dataframe.

In [ ]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [ ]:
df.fillna(0)

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    0.0         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    0.0         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

Q33. Write a Pandas program to convert index in to a column of the above dataframe.

In [ ]:
df.reset_index()

   index       name  score  attempts qualify
0      0  Anastasia   12.5         1     yes
1      1       Dima    9.0         3      no
2      2  Katherine   16.5         2     yes
3      3      James    NaN         3      no
4      4      Emily    9.0         2      no
5      5    Michael   20.0         3     yes
6      6    Matthew   14.5         1     yes
7      7      Laura    NaN         1      no
8      8      Kevin    8.0         2      no
9      9      Jonas   19.0         1     yes

Q34. Write a Pandas program to set a value 10.2 for a value 8 in score column using index value.

In [ ]:
# Sol-1
df.loc[df['score']==8,['score']]=10.2
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin   10.2         2      no
9      Jonas   19.0         1     yes

In [ ]:
# Sol-2
df.score.replace(8.0,10.2, inplace=True)
df
# we cant apply using map function, as map function will apply function to all rows and replace with Nan

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin   10.2         2      no
9      Jonas   19.0         1     yes

Q35. Write a Pandas program to count the NaN values in one or more columns in DataFrame.

In [ ]:
df.isna().values.sum()

2

Q36. Write a Pandas program to drop a list of rows from a specified DataFrame.

In [ ]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df6 = pd.DataFrame(d)
drop_rows=[2,4]
df6

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [ ]:
df6.drop(index=drop_rows)

   col1  col2  col3
0     1     4     7
1     4     5     8
3     4     7     0

Q37. Write a Pandas program to reset index in a given DataFrame after removing the first two rows

In [ ]:
df6.drop(index=[0,1]).reset_index(drop=True)

   col1  col2  col3
0     3     6     9
1     4     7     0
2     5     8     1

Q38. Write a Pandas program to devide a DataFrame in a ratio 70 : 30

In [ ]:
df8 = pd.DataFrame(np.random.randn(10, 2)) # Return a sample from std normal distribution of given size
df8

          0         1
0  0.650669 -1.214748
1  1.804092 -0.711781
2  2.119818  2.262078
3 -0.853321 -0.701927
4 -1.543390 -0.338259
5 -1.225789 -0.398036
6 -0.329860  1.123623
7 -1.471715  0.735647
8  1.326564  0.401907
9  0.748555  0.061533

In [ ]:
part_70=df8.sample(frac=0.7,random_state=10)
part_70

          0         1
8  1.326564  0.401907
2  2.119818  2.262078
5 -1.225789 -0.398036
6 -0.329860  1.123623
3 -0.853321 -0.701927
1  1.804092 -0.711781
0  0.650669 -1.214748

In [ ]:
df8.drop(part_70.index)  # ** .index will give all the index of perticular DF

          0         1
4 -1.543390 -0.338259
7 -1.471715  0.735647
9  0.748555  0.061533

Q39. Write a Pandas program to combining two series into a DataFrame.

In [ ]:
s1 = pd.Series(['100', '200', 'python', '300.12', '400'])
s2 = pd.Series(['10', '20', 'php', '30.12', '40'])

In [ ]:
# Sol-1
pd.DataFrame([s1,s2]).T

        0      1
0     100     10
1     200     20
2  python    php
3  300.12  30.12
4     400     40

In [ ]:
# Sol-2
pd.concat([s1,s2],axis=1)

        0      1
0     100     10
1     200     20
2  python    php
3  300.12  30.12
4     400     40

Q40. Write a Pandas program to shuffle a given DataFrame rows.

In [ ]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df9 = pd.DataFrame(exam_data)
df9

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [ ]:
df9.sample(frac=1)

        name  score  attempts qualify
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
0  Anastasia   12.5         1     yes
9      Jonas   19.0         1     yes
8      Kevin    8.0         2      no
4      Emily    9.0         2      no
1       Dima    9.0         3      no
7      Laura    NaN         1      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no

Q41. Write a Pandas program to convert DataFrame column type from string to datetime.

In [ ]:
s = pd.Series(['3/11/2000', '3/12/2000', '3/13/2000'])
s

0    3/11/2000
1    3/12/2000
2    3/13/2000
dtype: object

In [ ]:
pd.to_datetime(s)

0   2000-03-11
1   2000-03-12
2   2000-03-13
dtype: datetime64[ns]

Q42. Write a Pandas program to rename a col2 to Column2 in a given DataFrame.

In [ ]:
d = {'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]}
df5 = pd.DataFrame(data=d)
df5

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

In [ ]:
df5.rename(columns={'col2':'Column2'})

   col1  Column2  col3
0     1        4     7
1     2        5     8
2     3        6     9

Q43. Write a Pandas program to get a list of values in col2 in above DataFrame.

In [ ]:
# SOl-1
list(df5.col2.values)

[4, 5, 6]

In [ ]:
# Sol-2
df5.col2.to_list()

[4, 5, 6]

    Q44. Write a Pandas program to create a DataFrame from a Numpy array and specify the index column and column headers.

    Sample Output
              Column1  Column2  Column3
    Index1         0      0.0      0.0
    Index2         0      0.0      0.0
    Index3         0      0.0      0.0
    Index4         0      0.0      0.0
    Index5         0      0.0      0.0
    Index6         0      0.0      0.0
    Index7         0      0.0      0.0
    Index8         0      0.0      0.0
    Index9         0      0.0      0.0
    Index10        0      0.0      0.0
    Index11        0      0.0      0.0
    Index12        0      0.0      0.0
    Index13        0      0.0      0.0
    Index14        0      0.0      0.0
    Index15        0      0.0      0.0

In [ ]:
dtype = [('Column1','int32'), ('Column2','float32'), ('Column3','float32')] # Datatype of each column
values=np.zeros(15,dtype=dtype) # ** zeros(shape, dtype=float) # ** shape can be achieved even by dtype
values

array([[0., 0., 0.],
       [0., 0., 0.],
       [0., 0., 0.],
       [0., 0., 0.],
       [0., 0., 0.],
       [0., 0., 0.],
       [0., 0., 0.],
       [0., 0., 0.],
       [0., 0., 0.],
       [0., 0., 0.],
       [0., 0., 0.],
       [0., 0., 0.],
       [0., 0., 0.],
       [0., 0., 0.],
       [0., 0., 0.]])

In [ ]:
index = ['Index'+str(i) for i in range(1, len(z)+1)]
index

['Index1',
 'Index2',
 'Index3',
 'Index4',
 'Index5',
 'Index6',
 'Index7',
 'Index8',
 'Index9',
 'Index10',
 'Index11',
 'Index12',
 'Index13',
 'Index14',
 'Index15']

In [ ]:
pd.DataFrame(values, index=index)

         Column1  Column2  Column3
Index1         0      0.0      0.0
Index2         0      0.0      0.0
Index3         0      0.0      0.0
Index4         0      0.0      0.0
Index5         0      0.0      0.0
Index6         0      0.0      0.0
Index7         0      0.0      0.0
Index8         0      0.0      0.0
Index9         0      0.0      0.0
Index10        0      0.0      0.0
Index11        0      0.0      0.0
Index12        0      0.0      0.0
Index13        0      0.0      0.0
Index14        0      0.0      0.0
Index15        0      0.0      0.0

Q45. Write a Pandas program to find the row for where the value of a each col2 is maximum.

In [ ]:
d = {'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]}
df5 = pd.DataFrame(data=d)
df5

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

In [ ]:
# Sol1-1
print('max values:', df5.col2.max())
print('ID of max values:', df5.col2.idxmax())

max values: 6
ID of max values: 2

In [ ]:
# Sol-2
df5['col2'].argmax()

2

Q46. Write a Pandas program to check whether a col4, col1 are present in above DataFrame or not.

In [ ]:
if 'col4' in df.columns:
  print("Col4 is present in DataFrame.")
else:
  print("Col4 is not present in DataFrame.")

Col4 is not present in DataFrame.

In [ ]:
if 'col1' in df.columns:
  print("Col1 is present in DataFrame.")
else:
  print("Col1 is not present in DataFrame.")

Col1 is present in DataFrame.

Q47. Write a Pandas program to get the row1 value of above DataFrame.

In [ ]:
df5.iloc[[1],:]

   col1  col2  col3
1     2     5     8

Q48. Write a Pandas program to get the datatypes of columns of a DataFrame.

In [ ]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [ ]:
# Sol-1
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 448.0+ bytes

In [ ]:
# Sol-2
df.dtypes

name         object
score       float64
attempts      int64
qualify      object
dtype: object

Q49. Write a Pandas program to append data to an empty DataFrame.

In [ ]:
df0 = pd.DataFrame()
df0.append(df)

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

Q50. Write a Pandas program to sort above DataFrame by two columns: attempts, name.

In [ ]:
df.sort_values(['attempts', 'name'], ascending=[True, True])

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
9      Jonas   19.0         1     yes
7      Laura    NaN         1      no
6    Matthew   14.5         1     yes
4      Emily    9.0         2      no
2  Katherine   16.5         2     yes
8      Kevin    8.0         2      no
1       Dima    9.0         3      no
3      James    NaN         3      no
5    Michael   20.0         3     yes

Q51. Write a Pandas program to convert the datatype of a score column from floats to int.

In [ ]:
df.fillna(0,inplace=True)
df.score = df.score.astype(int)
df

        name  score  attempts qualify
0  Anastasia     12         1     yes
1       Dima      9         3      no
2  Katherine     16         2     yes
3      James      0         3      no
4      Emily      9         2      no
5    Michael     20         3     yes
6    Matthew     14         1     yes
7      Laura      0         1      no
8      Kevin      8         2      no
9      Jonas     19         1     yes

Q52. Write a Pandas program to replace infinite values with Nan values.

In [ ]:
df4 = pd.DataFrame([1000, 2000, 3000, -4000, np.inf, -np.inf])
df4

        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     inf
5    -inf

In [ ]:
df4.replace([np.inf, -np.inf], np.nan) 
# ** for inf always use np.inf
# ** For replacing multiple values to one unique value use replace

        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     NaN
5     NaN

Q53. Write a Pandas program to insert a col1 at a column index 0 in a DataFrame.

In [ ]:
d = {'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
col1 = [1, 2, 3, 4, 7] 
df5 = pd.DataFrame(data=d)
df5

   col2  col3
0     4     7
1     5     8
2     6    12
3     9     1
4     5    11

In [ ]:
# Sol-1
df5['col1']=col1
df5=df5[['col1','col2','col3']]
df5

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

In [ ]:
d = {'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
col1 = [1, 2, 3, 4, 7] 
df5 = pd.DataFrame(data=d)

# SOl-2
df5.insert(loc=0, column='col1', value=col1)
df5

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

Q54. Write a Pandas program to convert a given list of lists into a Dataframe. use 0th list as df column names

In [ ]:
my_lists = [['col1', 'col2'], [2, 4], [1, 3]]

In [ ]:
pd.DataFrame(my_lists[1:3],columns=my_lists[0]) 
# ** Slicing of list will not include end value eg[1:3], where as slicing of pandas dataframes include end value eg df.loc[[1:3],:]

   col1  col2
0     2     4
1     1     3

    Q55. Write a Pandas program to group by the first column and get second column as lists in rows.

    output:
    Group on the col1:
    col1
    C1          [1, 2]
    C2    [3, 3, 4, 5]
    C3             [6]

In [ ]:
df10 = pd.DataFrame( {'col1':['C1','C1','C2','C2','C2','C3','C2'], 'col2':[1,2,3,3,4,6,5]})
df10

  col1  col2
0   C1     1
1   C1     2
2   C2     3
3   C2     3
4   C2     4
5   C3     6
6   C2     5

In [ ]:
df10.groupby('col1')['col2'].apply(list)  # ** after groupby we call other columns instead of applying agg functions

col1
C1          [1, 2]
C2    [3, 3, 4, 5]
C3             [6]
Name: col2, dtype: object

Q56. Write a Pandas program to get column index for col2.

In [ ]:
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df5 = pd.DataFrame(data=d)
df5

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

In [ ]:
df5.columns.get_loc("col2")

1

Q57. Write a Pandas program to count number of columns of above DataFrame.

In [ ]:
len(df5.columns)

3

Q58. Write a Pandas program to select all columns, except col3 in above DataFrame.

In [ ]:
# Sol-1
df5.drop(columns=['col3'])

   col1  col2
0     1     4
1     2     5
2     3     6
3     4     9
4     7     5

In [ ]:
# Sol-2
df5.loc[:, df.columns != 'col3'] # ** we can apply conditions to filter columns instead of passing columns list

   col1  col2
0     1     4
1     2     5
2     3     6
3     4     9
4     7     5

Q59. Write a Pandas program to get first 3 records of above DataFrame

In [ ]:
# Sol-1
df5.iloc[0:3,:]

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12

In [ ]:
# Sol-2
df5.head(3)

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12

Q60. Write a Pandas program to get last 3 records of a DataFrame.

In [ ]:
df5.tail(3)

   col1  col2  col3
2     3     6    12
3     4     9     1
4     7     5    11

Q61. Write a Pandas program to get topmost 3 records within each column (col1,col2,col3) of above DataFrame.

In [ ]:
df5.nlargest(3, 'col1') # Col1

   col1  col2  col3
4     7     5    11
3     4     9     1
2     3     6    12

In [ ]:
df5.sort_values('col2',ascending=False).head(3) # Col2

   col1  col2  col3
3     4     9     1
2     3     6    12
1     2     5     8

In [ ]:
df5.nlargest(3, 'col3') # Col3

   col1  col2  col3
2     3     6    12
4     7     5    11
1     2     5     8

Q62. Write a Pandas program to remove first 3 rows of above given DataFrame.

In [ ]:
# Sol-1
df5.drop(index=[0,1,2])

   col1  col2  col3
3     4     9     1
4     7     5    11

In [ ]:
# Sol-2
df5.iloc[3:]

   col1  col2  col3
3     4     9     1
4     7     5    11

Q63. Write a Pandas program to remove last 3 rows of a given DataFrame.

In [ ]:
# Sol-1
df5.iloc[:2]

   col1  col2  col3
0     1     4     7
1     2     5     8

In [ ]:
#Sol-2  ** If index unkown or to avoid manual listing of index
l=df.tail(3).index.tolist()  # gives [2, 3, 4]
df5.drop(index=l)

   col1  col2  col3
0     1     4     7
1     2     5     8

    Q64. Write a Pandas program to add a prefix or suffix to all columns of a given DataFrame.
    output:
    Add prefix:
       A_W  A_X  A_Y  A_Z
    0   68   78   84   86
    ....

    Add suffix:
       W_1  X_1  Y_1  Z_1
    0   68   78   84   86
    ....

In [ ]:
df3 = pd.DataFrame({'W':[68,75,86,80,66],'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
df3

    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
2  86  96  89  96
3  80  80  83  72
4  66  86  86  83

In [ ]:
#Sol-1
l=df3.columns.values.tolist()
p=['A_'+i for i in l]
p

['A_W', 'A_X', 'A_Y', 'A_Z']

In [ ]:
df3.columns=['A_W', 'A_X', 'A_Y', 'A_Z']
df3

   A_W  A_X  A_Y  A_Z
0   68   78   84   86
1   75   85   94   97
2   86   96   89   96
3   80   80   83   72
4   66   86   86   83

In [291]:
s=[i+'_1' for i in l]
s

['W_1', 'X_1', 'Y_1', 'Z_1']

In [292]:
df3.columns=['A_W', 'A_X', 'A_Y', 'A_Z']
df3

   A_W  A_X  A_Y  A_Z
0   68   78   84   86
1   75   85   94   97
2   86   96   89   96
3   80   80   83   72
4   66   86   86   83

In [294]:
df3 = pd.DataFrame({'W':[68,75,86,80,66],'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
df3

# Sol-2
df3.add_prefix("A_")

   A_W  A_X  A_Y  A_Z
0   68   78   84   86
1   75   85   94   97
2   86   96   89   96
3   80   80   83   72
4   66   86   86   83

In [296]:
df.add_suffix("_1")

   W_1  X_1  Y_1  Z_1
0   68   78   84   86
1   75   85   94   97
2   86   96   89   96
3   80   80   83   72
4   66   86   86   83

    Q65. Write a Pandas program to reverse order (rows, columns) of above DataFrame.
    Reverse column order:
        Z   Y   X   W
    0  86  84  78  68
    1  97  94  85  75
    2  96  89  96  86
    3  72  83  80  80
    4  83  86  86  66

    Reverse row order:
        W   X   Y   Z
    4  66  86  86  83
    3  80  80  83  72
    2  86  96  89  96
    1  75  85  94  97
    0  68  78  84  86

In [298]:
df.loc[:, ::-1]

    Z   Y   X   W
0  86  84  78  68
1  97  94  85  75
2  96  89  96  86
3  72  83  80  80
4  83  86  86  66

In [299]:
df.loc[::-1]

    W   X   Y   Z
4  66  86  86  83
3  80  80  83  72
2  86  96  89  96
1  75  85  94  97
0  68  78  84  86

Q66. Write a Pandas program to select columns by data type (number, object) of a given DataFrame.

In [300]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [301]:
df.select_dtypes(include = "number") # **

   score  attempts
0   12.5         1
1    9.0         3
2   16.5         2
3    NaN         3
4    9.0         2
5   20.0         3
6   14.5         1
7    NaN         1
8    8.0         2
9   19.0         1

In [302]:
df.select_dtypes(include = "object")

        name qualify
0  Anastasia     yes
1       Dima      no
2  Katherine     yes
3      James      no
4      Emily      no
5    Michael     yes
6    Matthew     yes
7      Laura      no
8      Kevin      no
9      Jonas     yes

Q67. Write a Pandas program to split above DataFrame into two random subsets.

In [304]:
df_1 = df.sample(frac = 0.6)
df_1

        name  score  attempts qualify
5    Michael   20.0         3     yes
0  Anastasia   12.5         1     yes
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes
2  Katherine   16.5         2     yes
4      Emily    9.0         2      no

In [305]:
df_2 = df.drop(df_1.index)
df_2

      name  score  attempts qualify
1     Dima    9.0         3      no
3    James    NaN         3      no
6  Matthew   14.5         1     yes
7    Laura    NaN         1      no

Q68. Write a Pandas program to rename all column names by Remove trailing (at the end) whitesapce and convert to lowercase.

In [309]:
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})
df

             Name Date_Of_Birth    Age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
2     Ryan Parkes     25/09/1998  22.5
3    Eesha Hinton     11/05/2002  22.0
4    Syed Wharton     15/09/1997  23.0

In [310]:
df.columns = df.columns.str.lower()
df

             name date_of_birth    age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
2     Ryan Parkes     25/09/1998  22.5
3    Eesha Hinton     11/05/2002  22.0
4    Syed Wharton     15/09/1997  23.0

Q69. Write a Pandas program to merge datasets df2, df3 and check uniqueness.

In [ ]:
df1 = df.copy(deep = True)
df2 = df.drop([0, 1])
df3 = df1.drop([2])
#"one_to_one”: check if merge keys are unique in both left and right datasets:"'
#"one_to_many” or “1:m”: check if merge keys are unique in left dataset:'“many_to_one” or “m:1”: check if merge keys are unique in right dataset:''

Q70. Write a Pandas program to convert continuous values of a column in above DataFrame to categorical.

Q71. Write a Pandas program to display memory usage of a given DataFrame and every column of the DataFrame.

Q72. Write a Pandas program to combine many given series to create a DataFrame.

In [ ]:
sr1 = pd.Series(['php', 'python', 'java', 'c#', 'c++'])
sr2 = pd.Series([1, 2, 3, 4, 5])

Q73. Write a Pandas program to create DataFrames that contains random values, contains missing values, contains datetime values and contains mixed values.

Q74. Write a Pandas program to fill missing values in time series data.

From Wikipedia , in the mathematical field of numerical analysis, interpolation is a type of estimation, a method of constructing new data points within the range of a discrete set of known data points.

In [ ]:
sdata = {"c1":[120, 130 ,140, 150, np.nan, 170], "c2":[7, np.nan, 10, np.nan, 5.5, 16.5]}
df = pd.DataFrame(sdata)
df

Q75. Write a Pandas program to use a local variable within a query.

In [ ]:
df = pd.DataFrame({'W':[68,75,86,80,66],'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
df

Q76. Write a Pandas program to clean object column with mixed data of a given DataFrame using regular expression.

In [ ]:
d = {"agent": ["a001", "a002", "a003", "a003", "a004"], "purchase":[4500.00, 7500.00, "$3000.25", "$1250.35", "9000.00"]}
df = pd.DataFrame(d)
df

Q77. Write a Pandas program to get the numeric representation of an array by identifying distinct values of a given column of a DataFrame.

In [ ]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df

Q78. Write a Pandas program to replace the current value in a dataframe column based on last largest value. If the current value is less than last largest value replaces the value with 0.

In [ ]:
df1=pd.DataFrame({'rnum':[23, 21, 27, 22, 34, 33, 34, 31, 25, 22, 34, 19, 31, 32, 19]})

Q79. Write a Pandas program to create a DataFrame from the clipboard (data from an Excel spreadsheet or a Google Sheet).

Q80.Write a Pandas program to check for inequality of two given DataFrames.

In [ ]:
df1 = pd.DataFrame({'W':[68,75,86,80,None],'X':[78,85,None,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
df2 = pd.DataFrame({'W':[78,75,86,80,None],'X':[78,85,96,80,76], 'Y':[84,84,89,83,86],'Z':[86,97,96,72,83]});
df1
df2

Q81. Write a Pandas program to get lowest n records within each group of a given DataFrame.

In [ ]:
d = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
df = pd.DataFrame(data=d)
df